       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBD02.
      *********************************
      * AREA DE COMENTARIOS -REMARKS
      * AUTHOR = MATEUS (ALURA) MATAL
      * OBJETIVO: RECEBER DUAS VENDAS VIA CONSOLE
      *     CALCULAR E IMPRIMIR A MEDIA ARITMETICA COM CIFRAO
      * IMPRIMIR FORMATADO - XXX.XXX.XXX-XX
      * DATA = 21/05/2024
      ********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-VL1    PIC 9(06)V99 VALUE ZEROS.
       77 WRK-VL2    PIC 9(06)V99 VALUE ZEROS.
       77 WRK-MD     PIC 9(06)V99 VALUE ZEROS.
       77 WRK-MD-ED  PIC -ZZZ.ZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
           DISPLAY 'ENTRE COM O VALOR 1: '
           ACCEPT WRK-VL1 FROM CONSOLE.
           DISPLAY 'ENTRE COM O VALOR 2: '
           ACCEPT WRK-VL2 FROM CONSOLE
      ****************MOSTRA DADOS
           COMPUTE WRK-MD = (WRK-VL1 + WRK-VL2) / 2;
           MOVE WRK-MD TO WRK-MD-ED.
           DISPLAY 'A MEDIA DAS VENDAS EH R$' WRK-MD-ED.
           STOP RUN.
